vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
	}

	timer_interrupt_flag_clear(TIMER6, nIntFlag);
}
#endif
}

extern "C" {
/*
 * USART 0
 */
#if defined (DMX_USE_USART0)
# if defined (GD32F4XX) || defined (GD32H7XX)
void DMA1_Channel7_IRQHandler() {
	if (dma_interrupt_flag_get(DMA1, DMA_CH7, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA1, DMA_CH7, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::USART0_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::USART0_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0 , TIMER_CNT(TIMER1) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::USART0_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::USART0_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA1, DMA_CH7, DMA_INTERRUPT_FLAG_CLEAR);
}
# else
void DMA0_Channel3_IRQHandler() {
	if (dma_interrupt_flag_get(DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA0, DMA_CH3, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::USART0_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::USART0_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0 , TIMER_CNT(TIMER1) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::USART0_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::USART0_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
#endif
/*
 * USART 1
 */
#if defined (DMX_USE_USART1)
void DMA0_Channel6_IRQHandler() {
	if (dma_interrupt_flag_get(DMA0, DMA_CH6, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA0, DMA_CH6, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::USART1_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::USART1_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1 , TIMER_CNT(TIMER1) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::USART1_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::USART1_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA0, DMA_CH6, DMA_INTERRUPT_FLAG_CLEAR);
}
#endif
/*
 * USART 2
 */
#if defined (DMX_USE_USART2)
# if defined (GD32F4XX) || defined (GD32H7XX)
void DMA0_Channel3_IRQHandler() {
	if (dma_interrupt_flag_get(DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA0, DMA_CH3, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::USART2_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::USART2_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2 , TIMER_CNT(TIMER1) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::USART2_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::USART2_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR);
}
# else
void DMA0_Channel1_IRQHandler() {
	if (dma_interrupt_flag_get(DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA0, DMA_CH1, DMA_INTERRUPT_DISABLE);

		usart_flag_clear(USART2, USART_FLAG_TC);

		if (s_TxBuffer[dmx::config::USART2_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::USART2_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2 , TIMER_CNT(TIMER1) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::USART2_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::USART2_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
#endif
/*
 * UART 3
 */
#if defined (DMX_USE_UART3)
# if defined (GD32F4XX) || defined (GD32H7XX)
void DMA0_Channel4_IRQHandler() {
	if (dma_interrupt_flag_get(DMA0, DMA_CH4, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA0, DMA_CH4, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::UART3_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::UART3_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3 , TIMER_CNT(TIMER4) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::UART3_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::UART3_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA0, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR);
}
# else
void DMA1_Channel4_IRQHandler() {
	if (dma_interrupt_flag_get(DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA1, DMA_CH4, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::UART3_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::UART3_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3 , TIMER_CNT(TIMER1) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::UART3_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::UART3_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
#endif
/*
 * UART 4
 */
#if defined (DMX_USE_UART4)
# if defined (GD32F20X)
void DMA1_Channel3_IRQHandler() {
	if (dma_interrupt_flag_get(DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA1, DMA_CH3, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::UART4_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::UART4_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0 , TIMER_CNT(TIMER4) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::UART4_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::UART4_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
# if defined (GD32F4XX) || defined (GD32H7XX)
void DMA0_Channel7_IRQHandler() {
	if (dma_interrupt_flag_get(DMA0, DMA_CH7, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA0, DMA_CH7, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::UART4_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::UART4_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0 , TIMER_CNT(TIMER4) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::UART4_PORT].State = TxRxState::DMXINTER;
		}
	}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::UART4_PORT].Dmx.Sent++;
#endif

	dma_interrupt_flag_clear(DMA0, DMA_CH7, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
#endif
/*
 * USART 5
 */
#if defined (DMX_USE_USART5)
void DMA1_Channel6_IRQHandler() {
	if (dma_interrupt_flag_get(DMA1, DMA_CH6, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA1, DMA_CH6, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::USART5_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::USART5_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_1 , TIMER_CNT(TIMER4) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::USART5_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::USART5_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA1, DMA_CH6, DMA_INTERRUPT_FLAG_CLEAR);
}
#endif
/*
 * UART 6
 */
#if defined (DMX_USE_UART6)
# if defined (GD32F20X)
void DMA1_Channel4_IRQHandler() {
	if (dma_interrupt_flag_get(DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA1, DMA_CH4, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::UART6_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::UART6_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2 , TIMER_CNT(TIMER4) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::UART6_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::UART6_PORT].Dmx.Sent++;
#endif
	}

	dma_interrupt_flag_clear(DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
# if defined (GD32F4XX) || defined (GD32H7XX)
void DMA0_Channel1_IRQHandler() {
	if (dma_interrupt_flag_get(DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA0, DMA_CH1, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::UART6_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::UART6_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2 , TIMER_CNT(TIMER4) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::UART6_PORT].State = TxRxState::DMXINTER;
		}

#if !defined (CONFIG_DMX_DISABLE_STATISTICS)
		sv_TotalStatistics[dmx::config::UART6_PORT].Dmx.Sent++;
#endif
	}

